hanpig1998/2018-summer-artificial-car/code/stm32/Project/RVMDK（uv4）/pwm.C

#include "pwm.h"  
#include "stm32f10x.h"
 
void TIM3_PWM_INIT(u16 arr,u16 psc)  
{
	GPIO_InitTypeDef GPIO_InitStructure;
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	TIM_OCInitTypeDef TIM_OCInitStructure;
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB  | RCC_APB2Periph_AFIO, ENABLE);
	GPIO_PinRemapConfig(GPIO_PartialRemap_TIM3, ENABLE); 
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5; 
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP; 
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE); 
	TIM_TimeBaseStructure.TIM_Period = arr; 
	TIM_TimeBaseStructure.TIM_Prescaler = psc; 
	TIM_TimeBaseStructure.TIM_ClockDivision = 0;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;  
	TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure); 
	
	
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low;
	TIM_OC2Init(TIM3, &TIM_OCInitStructure);
	TIM_OC2PreloadConfig(TIM3, TIM_OCPreload_Enable);
	
	TIM_Cmd(TIM3, ENABLE);
}
 
void right_90(void)
{
	TIM3_PWM_INIT(9999,147);
	TIM_SetCompare2(TIM3,249);
}

void right_45(void)
{
	TIM3_PWM_INIT(9999,147);
	TIM_SetCompare2(TIM3,499);
}

void straight(void)
{
	TIM3_PWM_INIT(9999,147);
	TIM_SetCompare2(TIM3,749);
}

void left_45(void)
{
	TIM3_PWM_INIT(9999,147);
	TIM_SetCompare2(TIM3,999);
}

void left_90(void)
{
	TIM3_PWM_INIT(9999,147);
	TIM_SetCompare2(TIM3,4999);
}

